kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbfs.c
/*
 * NXP MCX N USBFS0 — USB Full-Speed (KHCI) controller, device mode.
 *
 * Register-accurate KHCI model plus a device-mode endpoint engine.  Guest
 * firmware arms Buffer Descriptors (BDs) in a RAM-resident BDT (ping-pong banks
 * per endpoint/direction); a remote USB host drives transactions through the
 * shared usbredir core (hw/usb/mcxn_usbdev.c).  We present SETUP/IN/OUT tokens
 * to firmware (STAT + ISTAT.TOKDNE), read/retire the BDs it armed, and relay the
 * descriptor-driven data back to the host.  Host token retries are modelled by a
 * 1 ms SOF tick (and re-checked when firmware acks TOKDNE), so the data stage of
 * a control transfer completes once the firmware ISR has armed the answering BD.
 *
 * Offsets/bits from the MCXN947 CMSIS header (USB_Type / PERI_USB.h).
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/timer.h"
#include "qapi/error.h"
#include "exec/cpu-common.h"
#include "hw/misc/mcxn_usbfs.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"

#include <usbredirproto.h>

/* Register offsets (8-bit registers on 32-bit stride; CMSIS USB_Type). */
#define R_PERID     0x00    /* RO */
#define R_IDCOMP    0x04    /* RO */
#define R_REV       0x08    /* RO */
#define R_ADDINFO   0x0C    /* RO */
#define R_OTGISTAT  0x10    /* W1C */
#define R_OTGICR    0x14
#define R_OTGSTAT   0x18    /* RO */
#define R_OTGCTL    0x1C
#define R_ISTAT     0x80    /* W1C */
#define R_INTEN     0x84
#define R_ERRSTAT   0x88    /* W1C */
#define R_ERREN     0x8C
#define R_STAT      0x90    /* RO */
#define R_CTL       0x94
#define R_ADDR      0x98
#define R_BDTPAGE1  0x9C
#define R_FRMNUML   0xA0
#define R_FRMNUMH   0xA4
#define R_TOKEN     0xA8
#define R_BDTPAGE2  0xB0
#define R_BDTPAGE3  0xB4
#define R_ENDPT0    0xC0    /* ENDPT[0..15] @ 0xC0, step 4 */
#define R_USBCTRL   0x100
#define R_USBTRC0   0x10C

/* CTL bits. */
#define CTL_USBENSOFEN  (1u << 0)
#define CTL_ODDRST      (1u << 1)
#define CTL_HOSTMODEEN  (1u << 3)
#define CTL_RESET       (1u << 4)   /* host: drive a USB bus reset (SE0) */
#define USBTRC0_USBRESET (1u << 7)

/* ISTAT / INTEN bits. */
#define ISTAT_USBRST    (1u << 0)
#define ISTAT_ERROR     (1u << 1)
#define ISTAT_SOFTOK    (1u << 2)
#define ISTAT_TOKDNE    (1u << 3)
#define ISTAT_SLEEP     (1u << 4)
#define ISTAT_RESUME    (1u << 5)
#define ISTAT_ATTACH    (1u << 6)   /* device attached (host mode) */
#define ISTAT_STALL     (1u << 7)

/* STAT fields. */
#define STAT_ODD_SHIFT  2
#define STAT_TX         (1u << 3)
#define STAT_ENDP_SHIFT 4

/* ENDPT bits. */
#define ENDPT_EPHSHK    (1u << 0)
#define ENDPT_EPSTALL   (1u << 1)
#define ENDPT_EPTXEN    (1u << 2)
#define ENDPT_EPRXEN    (1u << 3)

/* BD control word (SW view) bits, and completion fields. */
#define BD_STALL    (1u << 2)
#define BD_DTS      (1u << 3)
#define BD_NINC     (1u << 4)
#define BD_KEEP     (1u << 5)
#define BD_DATA1    (1u << 6)
#define BD_OWN      (1u << 7)
#define BD_BC_SHIFT     16
#define BD_BC_MASK      0x3FF       /* 10-bit byte count */
#define BD_TOKPID_SHIFT 2
#define BD_TOKPID_MASK  0xF

/* Token PIDs (as reported in the retired BD's tok_pid field). */
#define PID_OUT     0x1
#define PID_IN      0x9
#define PID_SETUP   0xD

#define PERID_VALUE     0x04
#define IDCOMP_VALUE    0xFB
#define REV_VALUE       0x33

#define SOF_PERIOD_NS   (1 * 1000 * 1000)   /* 1 ms */

static void usbfs_update_irq(MCXNUSBFSState *s)
{
    bool active =
        ((s->regs[R_ISTAT / 4]    & s->regs[R_INTEN / 4])  & 0xFF) ||
        ((s->regs[R_ERRSTAT / 4]  & s->regs[R_ERREN / 4])  & 0xFF) ||
        ((s->regs[R_OTGISTAT / 4] & s->regs[R_OTGICR / 4]) & 0xFF);

    qemu_set_irq(s->irq, active);
}

/* ------------------------------------------------------------------------- *
 * BDT access.  Base = {BDTPAGE3,BDTPAGE2,BDTPAGE1,0} (512-byte aligned).
 * BD index = (ep*4) + (tx ? 2 : 0) + odd; each BD is 8 bytes (ctrl, buf).
 * ------------------------------------------------------------------------- */

static uint32_t bdt_base(MCXNUSBFSState *s)
{
    return ((s->regs[R_BDTPAGE1 / 4] & 0xFF) << 8)  |
           ((s->regs[R_BDTPAGE2 / 4] & 0xFF) << 16) |
           ((s->regs[R_BDTPAGE3 / 4] & 0xFF) << 24);
}

static uint32_t bd_off(int ep, bool tx, int odd)
{
    return ((ep * 4) + (tx ? 2 : 0) + (odd & 1)) * 8;
}

static uint32_t bd_ld(uint32_t addr)
{
    uint32_t w = 0;
    cpu_physical_memory_read(addr, &w, 4);
    return le32_to_cpu(w);
}

static void bd_st(uint32_t addr, uint32_t w)
{
    uint32_t t = cpu_to_le32(w);
    cpu_physical_memory_write(addr, &t, 4);
}

/* Raise TOKDNE for a just-retired BD and stash which one in STAT. */
static void usbfs_tokdne(MCXNUSBFSState *s, int ep, bool tx, int odd)
{
    s->regs[R_STAT / 4] = (ep << STAT_ENDP_SHIFT) |
                          (tx ? STAT_TX : 0) |
                          ((odd & 1) << STAT_ODD_SHIFT);
    s->regs[R_ISTAT / 4] |= ISTAT_TOKDNE;
    s->tokdne_busy = true;
    usbfs_update_irq(s);
}

/* ------------------------------------------------------------------------- *
 * HOST mode.  With CTL[HOSTMODEEN] the guest IS the USB host: it programs ADDR
 * (target device address) and arms a BD, then writes TOKEN (PID + endpoint) to
 * launch ONE transaction.  We read the armed BD, drive the packet to the device
 * attached on our own usb-bus via the QEMU USB core, copy the data, retire the
 * BD and raise TOKDNE -- the device-mode path with "who initiates" swapped.
 * SETUP/OUT send from the TX BD; IN fills the RX BD.  Synchronous completion is
 * handled inline; async (a NAKing interrupt-IN awaiting data) finishes in the
 * port .complete callback.
 * ------------------------------------------------------------------------- */

static void usbfs_host_retire(MCXNUSBFSState *s, uint32_t ba, int pid_field,
                              bool tx, int ep, int odd, int len)
{
    bd_st(ba, ((uint32_t)len << BD_BC_SHIFT) | (pid_field << BD_TOKPID_SHIFT));
    if (tx) {
        s->odd_tx[ep] ^= 1;
    } else {
        s->odd_rx[ep] ^= 1;
    }
    usbfs_tokdne(s, ep, tx, odd);
}

