kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbfs.c
/* Report a host-side transaction error on the non-gating ERRSTAT channel so the
 * guest's host stack sees a failed transaction rather than hanging. */
static void usbfs_host_error(MCXNUSBFSState *s, uint32_t bit)
{
    s->regs[R_ERRSTAT / 4] |= bit;
    if (s->regs[R_ERRSTAT / 4] & s->regs[R_ERREN / 4] & 0xFF) {
        s->regs[R_ISTAT / 4] |= ISTAT_ERROR;
    }
    usbfs_update_irq(s);
}

static void usbfs_host_token(MCXNUSBFSState *s, uint8_t token)
{
    int pid_field = (token >> 4) & 0xF;
    int ep = token & 0xF;
    uint8_t addr = s->regs[R_ADDR / 4] & 0x7F;
    bool is_setup = (pid_field == PID_SETUP);
    bool is_in = (pid_field == PID_IN);
    bool tx = !is_in;                    /* SETUP/OUT send from TX BD; IN fills RX BD */
    int odd = (tx ? s->odd_tx[ep] : s->odd_rx[ep]) & 1;
    uint32_t base = bdt_base(s);
    uint32_t ba = base + bd_off(ep, tx, odd);
    uint32_t ctrl = bd_ld(ba);
    uint32_t bufaddr;
    int bc, qpid, len;
    USBDevice *dev;
    USBEndpoint *uep;

    if (!(ctrl & BD_OWN)) {
        return;                          /* firmware has not armed a BD for this direction */
    }
    dev = usb_find_device(&s->host_port, addr);
    if (!dev) {
        usbfs_host_error(s, 0x01);       /* PIDERR / no device answering: bus timeout */
        return;
    }

    bufaddr = bd_ld(ba + 4);
    bc = (ctrl >> BD_BC_SHIFT) & BD_BC_MASK;
    if (bc > MCXN_USBFS_MPS) {
        bc = MCXN_USBFS_MPS;
    }
    qpid = is_setup ? USB_TOKEN_SETUP : is_in ? USB_TOKEN_IN : USB_TOKEN_OUT;
    uep = usb_ep_get(dev, qpid, ep);
    usb_packet_setup(&s->host_pkt, qpid, uep, 0, ba, !is_in, true);
    if (!is_in) {
        cpu_physical_memory_read(bufaddr, s->host_buf, bc);
    }
    usb_packet_addbuf(&s->host_pkt, s->host_buf, bc);
    usb_handle_packet(dev, &s->host_pkt);

    if (s->host_pkt.status == USB_RET_ASYNC) {
        s->host_pend_ba = ba;
        s->host_pend_bufaddr = bufaddr;
        s->host_pend_ep = ep;
        s->host_pend_pid = pid_field;
        s->host_pend_odd = odd;
        s->host_pend_tx = tx;
        s->host_pend_in = is_in;
        s->host_pend_busy = true;
        return;                          /* completes in mcxn_usbfs_host_complete */
    }
    if (s->host_pkt.status >= 0) {       /* success: actual_length bytes moved */
        len = s->host_pkt.actual_length;
        if (is_in) {
            cpu_physical_memory_write(bufaddr, s->host_buf, len);
        }
        usbfs_host_retire(s, ba, pid_field, tx, ep, odd, len);
    } else if (s->host_pkt.status == USB_RET_STALL) {
        usbfs_host_error(s, 0x80);       /* BTSERR-class: device STALLed the token */
    }
    /* NAK/NYET: leave the BD owned; the guest host stack re-issues the token. */
}

static void mcxn_usbfs_host_attach(USBPort *port)
{
    MCXNUSBFSState *s = port->opaque;

    if (s->host_mode) {
        s->regs[R_ISTAT / 4] |= ISTAT_ATTACH;
        usbfs_update_irq(s);
    }
}

static void mcxn_usbfs_host_detach(USBPort *port)
{
    MCXNUSBFSState *s = port->opaque;

    if (s->host_mode) {
        s->regs[R_ISTAT / 4] |= ISTAT_ATTACH;   /* ATTACH latches the change of state */
        usbfs_update_irq(s);
    }
}

static void mcxn_usbfs_host_child_detach(USBPort *port, USBDevice *child)
{
}

static void mcxn_usbfs_host_wakeup(USBPort *port)
{
}

static void mcxn_usbfs_host_complete(USBPort *port, USBPacket *p)
{
    MCXNUSBFSState *s = port->opaque;

    if (!s->host_pend_busy || p != &s->host_pkt) {
        return;
    }
    s->host_pend_busy = false;
    if (p->status >= 0) {
        int len = p->actual_length;
        if (s->host_pend_in) {
            cpu_physical_memory_write(s->host_pend_bufaddr, s->host_buf, len);
        }
        usbfs_host_retire(s, s->host_pend_ba, s->host_pend_pid,
                          s->host_pend_tx, s->host_pend_ep, s->host_pend_odd, len);
    } else if (p->status == USB_RET_STALL) {
        usbfs_host_error(s, 0x80);
    }
}

static USBPortOps mcxn_usbfs_port_ops = {
    .attach       = mcxn_usbfs_host_attach,
    .detach       = mcxn_usbfs_host_detach,
    .child_detach = mcxn_usbfs_host_child_detach,
    .wakeup       = mcxn_usbfs_host_wakeup,
    .complete     = mcxn_usbfs_host_complete,
};

static USBBusOps mcxn_usbfs_bus_ops = { };

/* ------------------------------------------------------------------------- *
 * Endpoint servicing — runs when a BD might be ready (SOF tick / TOKDNE ack).
 * Only one token is outstanding to firmware at a time (tokdne_busy gate), as
 * with the real STAT/TOKDNE handshake.
 * ------------------------------------------------------------------------- */

static bool usbfs_deliver_setup(MCXNUSBFSState *s)
{
    int odd = s->odd_rx[0] & 1;
    uint32_t base = bdt_base(s);
    uint32_t ba = base + bd_off(0, false, odd);
    uint32_t ctrl = bd_ld(ba);

    if (!(ctrl & BD_OWN)) {
        return false;                       /* firmware hasn't armed EP0 RX */
    }
    cpu_physical_memory_write(bd_ld(ba + 4), s->setup_pkt, 8);
    bd_st(ba, (8u << BD_BC_SHIFT) | (PID_SETUP << BD_TOKPID_SHIFT));
    s->odd_rx[0] ^= 1;
    s->setup_pending = false;
    usbfs_tokdne(s, 0, false, odd);
    return true;
}

static bool usbfs_service_in(MCXNUSBFSState *s, int ep)
{
    MCXNUSBFSXfer *x = &s->ep[ep];
    int odd = s->odd_tx[ep] & 1;
    uint32_t base = bdt_base(s);
    uint32_t ba = base + bd_off(ep, true, odd);
    uint32_t ctrl = bd_ld(ba);
    int bc;

    if (!(ctrl & BD_OWN)) {
        return false;                       /* firmware hasn't armed IN data */
    }
    bc = (ctrl >> BD_BC_SHIFT) & BD_BC_MASK;
    if (bc > MCXN_USBFS_MPS) {
        bc = MCXN_USBFS_MPS;
    }
    if (x->in_acc + bc > MCXN_USBFS_XFERMAX) {
        bc = MCXN_USBFS_XFERMAX - x->in_acc;
    }
    cpu_physical_memory_read(bd_ld(ba + 4), x->in_buf + x->in_acc, bc);
    x->in_acc += bc;
    bd_st(ba, ((uint32_t)bc << BD_BC_SHIFT) | (PID_IN << BD_TOKPID_SHIFT));
    s->odd_tx[ep] ^= 1;
    usbfs_tokdne(s, ep, true, odd);

    /* Transfer complete on a short packet or once the host's ask is met. */
    if (bc < MCXN_USBFS_MPS || x->in_acc >= x->in_len ||
        x->in_acc >= MCXN_USBFS_XFERMAX) {
        x->in_pending = false;
        mcxn_usbdev_complete_in(s->usbdev, ep, x->in_buf, x->in_acc);
    }
    return true;
}

