kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbfs.c
static bool usbfs_service_out(MCXNUSBFSState *s, int ep)
{
    MCXNUSBFSXfer *x = &s->ep[ep];
    int odd = s->odd_rx[ep] & 1;
    uint32_t base = bdt_base(s);
    uint32_t ba = base + bd_off(ep, false, odd);
    uint32_t ctrl = bd_ld(ba);
    int chunk = x->out_len - x->out_off;

    if (!(ctrl & BD_OWN)) {
        return false;                       /* firmware hasn't armed RX buf */
    }
    if (chunk > MCXN_USBFS_MPS) {
        chunk = MCXN_USBFS_MPS;
    }
    cpu_physical_memory_write(bd_ld(ba + 4), x->out_buf + x->out_off, chunk);
    x->out_off += chunk;
    bd_st(ba, ((uint32_t)chunk << BD_BC_SHIFT) | (PID_OUT << BD_TOKPID_SHIFT));
    s->odd_rx[ep] ^= 1;
    usbfs_tokdne(s, ep, false, odd);

    if (x->out_off >= x->out_len || chunk < MCXN_USBFS_MPS) {
        x->out_pending = false;
        mcxn_usbdev_complete_out(s->usbdev, ep, MCXN_USB_XFER_OK, x->out_len);
    }
    return true;
}

/*
 * Consume the firmware's zero-length status-stage IN BD for a no-data (or OUT)
 * control transfer.  usbredir collapses the 3-stage control handshake into one
 * message and the core acks it directly, but real firmware still arms a status
 * BD per stage — draining it here keeps the EP0 TX ping-pong bank in sync with
 * firmware so the next IN reads the right bank.
 */
static bool usbfs_consume_status_in(MCXNUSBFSState *s)
{
    int odd = s->odd_tx[0] & 1;
    uint32_t ba = bdt_base(s) + bd_off(0, true, odd);
    uint32_t ctrl = bd_ld(ba);

    if (!(ctrl & BD_OWN)) {
        return false;                       /* firmware hasn't armed it yet */
    }
    bd_st(ba, (PID_IN << BD_TOKPID_SHIFT));  /* retire, zero byte count */
    s->odd_tx[0] ^= 1;
    s->ep0_status_in = false;
    usbfs_tokdne(s, 0, true, odd);
    /* The host->device control transfer is now complete (firmware saw the SETUP
     * and ran the status stage): ack the host.  No-op if a data stage already
     * completed it. */
    mcxn_usbdev_complete_out(s->usbdev, 0, MCXN_USB_XFER_OK, 0);
    return true;
}

/* Try to make progress on one outstanding transaction. */
static void usbfs_service(MCXNUSBFSState *s)
{
    int ep;

    if (!s->enabled || s->tokdne_busy) {
        return;                             /* wait for firmware to ack TOKDNE */
    }
    if (s->ep0_status_in && usbfs_consume_status_in(s)) {
        return;
    }
    if (s->setup_pending && usbfs_deliver_setup(s)) {
        return;
    }
    for (ep = 0; ep < MCXN_USBFS_NEP; ep++) {
        if (s->ep[ep].in_pending && usbfs_service_in(s, ep)) {
            return;
        }
        if (s->ep[ep].out_pending && usbfs_service_out(s, ep)) {
            return;
        }
    }
}

static void usbfs_sof(void *opaque)
{
    MCXNUSBFSState *s = opaque;

    if (!s->enabled) {
        return;
    }
    s->regs[R_FRMNUML / 4] = (s->regs[R_FRMNUML / 4] + 1) & 0xFF;
    s->regs[R_ISTAT / 4] |= ISTAT_SOFTOK;
    usbfs_update_irq(s);
    usbfs_service(s);
    /* Re-arm from the previous DEADLINE, never from "now": re-adding the
     * callback's dispatch latency every frame makes the error accumulate, and
     * the USB frame rate is a timing contract, not a suggestion. */
    s->next_sof_ns += SOF_PERIOD_NS;
    timer_mod(s->sof, s->next_sof_ns);
}

/* ------------------------------------------------------------------------- *
 * usbredir backend ops — host transactions arrive here from the core.
 * ------------------------------------------------------------------------- */

static void usbfs_be_setup(void *be, const uint8_t setup[8])
{
    MCXNUSBFSState *s = be;

    memcpy(s->setup_pkt, setup, 8);
    s->setup_pending = true;
    /* Host->device control (SETUP bmRequestType bit7=0) has a zero-length IN
     * status stage the firmware will arm; remember to drain it.  Only SET the
     * flag (never clear it for an IN transfer) so a still-pending status from a
     * prior OUT transfer survives — the tokdne_busy gate drains it before this
     * SETUP is delivered. */
    if (!(setup[0] & 0x80)) {
        s->ep0_status_in = true;
    }
    /* Reset EP0 transfer accumulators for the new control transaction. */
    s->ep[0].in_pending = false;
    s->ep[0].in_acc = 0;
    s->ep[0].out_pending = false;
    s->ep[0].out_off = 0;
    usbfs_service(s);
}

static int usbfs_be_ep_in(void *be, int ep, uint8_t *buf, int len, int *out_len)
{
    MCXNUSBFSState *s = be;
    MCXNUSBFSXfer *x = &s->ep[ep & 0xf];

    if ((s->regs[(R_ENDPT0 + (ep & 0xf) * 4) / 4] & ENDPT_EPSTALL)) {
        return MCXN_USB_XFER_STALL;
    }
    x->in_pending = true;
    x->in_len = len;
    x->in_acc = 0;
    *out_len = 0;
    usbfs_service(s);
    return MCXN_USB_XFER_ASYNC;     /* answered later via complete_in() */
}

static int usbfs_be_ep_out(void *be, int ep, const uint8_t *buf, int len)
{
    MCXNUSBFSState *s = be;
    MCXNUSBFSXfer *x = &s->ep[ep & 0xf];

    if ((s->regs[(R_ENDPT0 + (ep & 0xf) * 4) / 4] & ENDPT_EPSTALL)) {
        return MCXN_USB_XFER_STALL;
    }
    if (len > MCXN_USBFS_XFERMAX) {
        len = MCXN_USBFS_XFERMAX;
    }
    if (len) {
        memcpy(x->out_buf, buf, len);
    }
    x->out_len = len;
    x->out_off = 0;
    x->out_pending = true;
    usbfs_service(s);
    return MCXN_USB_XFER_ASYNC;     /* answered later via complete_out() */
}

static void usbfs_be_set_address(void *be, uint8_t addr) { /* firmware writes ADDR */ }
static void usbfs_be_set_config(void *be, uint8_t cfg)   { /* firmware handles */ }

/* Host USB bus reset: drop transient transfer state and post ISTAT.USBRST + IRQ
 * so guest firmware re-inits its BDT/endpoints for a fresh enumeration (lets a
 * reused usbredir server re-enumerate a new client). */
static void usbfs_be_bus_reset(void *be)
{
    MCXNUSBFSState *s = be;
    int ep;

    for (ep = 0; ep < MCXN_USBFS_NEP; ep++) {
        s->ep[ep].in_pending = false;
        s->ep[ep].in_acc = 0;
        s->ep[ep].out_pending = false;
        s->ep[ep].out_off = 0;
    }
    s->ep0_status_in = false;
    memset(s->odd_rx, 0, sizeof(s->odd_rx));  /* ping-pong banks back to even, */
    memset(s->odd_tx, 0, sizeof(s->odd_tx));  /* matching firmware's re-arm     */
    s->regs[R_ISTAT / 4] |= ISTAT_USBRST;   /* USB reset flag */
    usbfs_update_irq(s);                     /* fires if firmware enabled USBRST */
}

static const MCXNUsbBackendOps usbfs_be_ops = {
    .setup       = usbfs_be_setup,
    .ep_in       = usbfs_be_ep_in,
    .ep_out      = usbfs_be_ep_out,
    .set_address = usbfs_be_set_address,
    .set_config  = usbfs_be_set_config,
    .bus_reset   = usbfs_be_bus_reset,
};

