kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbfs.c
/* ------------------------------------------------------------------------- *
 * MMIO.
 * ------------------------------------------------------------------------- */

static uint64_t mcxn_usbfs_read(void *opaque, hwaddr off, unsigned size)
{
    MCXNUSBFSState *s = MCXN_USBFS(opaque);

    switch (off) {
    case R_PERID:   return PERID_VALUE;
    case R_IDCOMP:  return IDCOMP_VALUE;
    case R_REV:     return REV_VALUE;
    case R_USBTRC0:
        return s->regs[R_USBTRC0 / 4] & ~USBTRC0_USBRESET;
    default:
        return (off < MCXN_USBFS_SIZE) ? s->regs[off >> 2] : 0;
    }
}

static void mcxn_usbfs_write(void *opaque, hwaddr off, uint64_t value,
                             unsigned size)
{
    MCXNUSBFSState *s = MCXN_USBFS(opaque);
    uint32_t v = value;

    if (off >= MCXN_USBFS_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB write @0x%" HWADDR_PRIx "\n",
                      __func__, off);
        return;
    }

    switch (off) {
    case R_PERID:
    case R_IDCOMP:
    case R_REV:
    case R_ADDINFO:
    case R_OTGSTAT:
    case R_STAT:
        return;                             /* read-only */
    case R_OTGISTAT:
    case R_ERRSTAT:
        s->regs[off >> 2] &= ~(v & 0xFF);   /* W1C */
        usbfs_update_irq(s);
        return;
    case R_ISTAT:
        s->regs[off >> 2] &= ~(v & 0xFF);   /* W1C */
        if (v & ISTAT_TOKDNE) {
            /* Firmware consumed the token: STAT advances, service the next. */
            s->tokdne_busy = false;
            usbfs_update_irq(s);
            usbfs_service(s);
            return;
        }
        usbfs_update_irq(s);
        return;
    case R_CTL:
        s->regs[off >> 2] = v;
        if (v & CTL_ODDRST) {
            memset(s->odd_rx, 0, sizeof(s->odd_rx));
            memset(s->odd_tx, 0, sizeof(s->odd_tx));
        }
        s->host_mode = (v & CTL_HOSTMODEEN) != 0;
        if ((v & CTL_USBENSOFEN) && !s->enabled) {
            s->enabled = true;
            s->next_sof_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
                             SOF_PERIOD_NS;
            timer_mod(s->sof, s->next_sof_ns);
            if (!s->host_mode) {
                /* Device mode + pull-up: a device appears on the remote host's bus. */
                mcxn_usbdev_attach(s->usbdev, usb_redir_speed_full);
            }
        } else if (!(v & CTL_USBENSOFEN) && s->enabled) {
            s->enabled = false;
            timer_del(s->sof);
            if (!s->host_mode) {
                mcxn_usbdev_detach(s->usbdev);
            }
        }
        /* Host mode enabled while a device is already plugged into our port:
         * latch the ATTACH the guest's host stack polls for. */
        if (s->host_mode && s->host_port.dev) {
            s->regs[R_ISTAT / 4] |= ISTAT_ATTACH;
            usbfs_update_irq(s);
        }
        /* CTL[RESET]: drive a USB bus reset.  The attached device leaves the
         * ATTACHED state for DEFAULT (address 0) -- the state in which it is
         * addressable, so enumeration can begin. */
        if (s->host_mode && (v & CTL_RESET) && s->host_port.dev) {
            usb_device_reset(s->host_port.dev);
        }
        return;
    case R_TOKEN:
        s->regs[off >> 2] = v;
        if (s->host_mode && s->enabled) {
            usbfs_host_token(s, v & 0xFF);      /* launch one host transaction */
        }
        return;
    case R_USBTRC0:
        s->regs[off >> 2] = v & ~USBTRC0_USBRESET;
        return;
    case R_INTEN:
    case R_ERREN:
    case R_OTGICR:
        s->regs[off >> 2] = v;
        usbfs_update_irq(s);
        return;
    default:
        s->regs[off >> 2] = v;
        return;
    }
}

static const MemoryRegionOps mcxn_usbfs_ops = {
    .read = mcxn_usbfs_read,
    .write = mcxn_usbfs_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

/* USBFS reset values from the RM (USBCTRL / OBSERVE / KEEP_ALIVE / ADDINFO). */
static const struct { uint16_t off; uint8_t width; uint32_t val; } rst_tbl[] = {
    { 0x000,  8, 0x00000004u },   /* PERID */
    { 0x004,  8, 0x000000FBu },   /* IDCOMP */
    { 0x008,  8, 0x00000033u },   /* REV */
    { 0x00C,  8, 0x00000001u },   /* ADDINFO */
    { 0x100,  8, 0x000000C0u },   /* USBCTRL */
    { 0x104,  8, 0x00000050u },   /* OBSERVE */
    { 0x124,  8, 0x00000008u },   /* KEEP_ALIVE_CTRL */
    { 0x128,  8, 0x00000001u },   /* KEEP_ALIVE_WKCTRL */
    { 0x144,  8, 0x00000001u },   /* CLK_RECOVER_IRC_EN */
};

/* regs[] is a WORD array and not every register is 32 bits: a 16-bit register at an odd
 * halfword offset SHARES ITS WORD with its neighbour, so a plain regs[off/4] = val
 * CLOBBERS THE NEIGHBOUR.  Write into the correct byte lane. */
static void mcxn_usbfs_set_reset(uint32_t *regs, uint16_t off, uint8_t width, uint32_t val)
{
    uint32_t *word = &regs[off / 4];
    int shift = (off & 3) * 8;
    uint32_t mask = (width == 8) ? 0xFFu : (width == 16) ? 0xFFFFu : 0xFFFFFFFFu;

    *word = (*word & ~(mask << shift)) | ((val & mask) << shift);
}

static void mcxn_usbfs_reset(DeviceState *dev)
{
    MCXNUSBFSState *s = MCXN_USBFS(dev);
    int rst_i;

    memset(s->regs, 0, sizeof(s->regs));
    for (rst_i = 0; rst_i < (int)ARRAY_SIZE(rst_tbl); rst_i++) {
        mcxn_usbfs_set_reset(s->regs, rst_tbl[rst_i].off, rst_tbl[rst_i].width, rst_tbl[rst_i].val);
    }
    memset(s->odd_rx, 0, sizeof(s->odd_rx));
    memset(s->odd_tx, 0, sizeof(s->odd_tx));
    memset(s->ep, 0, sizeof(s->ep));
    s->enabled = false;
    s->tokdne_busy = false;
    s->setup_pending = false;
    timer_del(s->sof);
}

static void mcxn_usbfs_realize(DeviceState *dev, Error **errp)
{
    MCXNUSBFSState *s = MCXN_USBFS(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &mcxn_usbfs_ops, s,
                          TYPE_MCXN_USBFS, MCXN_USBFS_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);

