kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbfs.c
    s->sof = timer_new_ns(QEMU_CLOCK_VIRTUAL, usbfs_sof, s);

    if (s->usbdev) {
        mcxn_usbdev_set_backend(s->usbdev, &usbfs_be_ops, s);
    }

    /* Host mode: our own single-port full-speed usb-bus, so a QEMU USB device
     * (-device usb-kbd,bus=<id>) can attach and the guest host stack enumerate it. */
    usb_bus_new(&s->host_bus, sizeof(s->host_bus), &mcxn_usbfs_bus_ops, dev);
    usb_register_port(&s->host_bus, &s->host_port, s, 0,
                      &mcxn_usbfs_port_ops, USB_SPEED_MASK_FULL);
    usb_packet_init(&s->host_pkt);
}

static const VMStateDescription vmstate_mcxn_usbfs = {
    .name = TYPE_MCXN_USBFS,
    .version_id = 2,
    .minimum_version_id = 2,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, MCXNUSBFSState, MCXN_USBFS_SIZE / 4),
        VMSTATE_END_OF_LIST()
    },
};

static const Property mcxn_usbfs_props[] = {
    DEFINE_PROP_LINK("usbdev", MCXNUSBFSState, usbdev, TYPE_MCXN_USBDEV,
                     MCXNUsbDevState *),
};

static void mcxn_usbfs_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_usbfs_realize;
    device_class_set_legacy_reset(dc, mcxn_usbfs_reset);
    device_class_set_props(dc, mcxn_usbfs_props);
    dc->vmsd = &vmstate_mcxn_usbfs;
}

static const TypeInfo mcxn_usbfs_types[] = {
    {
        .name          = TYPE_MCXN_USBFS,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNUSBFSState),
        .class_init    = mcxn_usbfs_class_init,
    },
};

DEFINE_TYPES(mcxn_usbfs_types)
